<template><div><h1 id="快速开始" tabindex="-1"><a class="header-anchor" href="#快速开始" aria-hidden="true">#</a> 快速开始</h1>
<p>根据本文档快速开始使用村账系统吧！将从用户登录(制作中)-&gt;数据导入-&gt;仪表盘使用-&gt;数据查看页使用-&gt;工具中心进行讲解，同时将以杨村甸乡财政所为例，展开讲解对村账系统的使用。</p>
<p>如果您是第一次使用，请联系我确定乡镇村、社区信息，并作出针对性的优化后，以一个月末为基础，录入余额信息，运维qq：908803958。</p>
<h2 id="用户登录" tabindex="-1"><a class="header-anchor" href="#用户登录" aria-hidden="true">#</a> 用户登录</h2>
<p>截止2023年11月29日19:40:24，由于稳定性原因，目前该功能暂未上线，后续更新上线后将补充这方面文档。</p>
<h2 id="数据导入" tabindex="-1"><a class="header-anchor" href="#数据导入" aria-hidden="true">#</a> 数据导入</h2>
<p>第一批进行试点乡镇均开通了湖南农信的网银，因此首先我们需要从银行系统导出银行给出的数据。<br>
首先在湖南农信银行界面导出一个时间点的银行表（千万不要重复导入，目前一键去重功能可能导致金额异常！！！）</p>
<p>例如选择11月</p>
<center> <img src="/images/选择一个完整的月交易日期.png" alt="选择一个完整的月交易日期"></center>
<p>选择后将银行流水以Excel形式导出</p>
<center> <img src="/images/在网银下面点击保存为excel.png" alt="在网银下面点击保存为excel"></center>
<p>接下来在我们的系统左边导航栏一次点击工具中心-&gt;银行数据导入</p>
<center> <img src="/images/银行导入.png" alt="银行导入"></center>
<p>接下来选择我们从银行下载下来的Excel文件并进行导入</p>
<center> <img src="/images/选择银行文件.png" alt="选择银行文件"></center>
<p>确认导入的信息（确认后进行导入，由于技术能力有限，该功能可能存在暂未排查到的错误。如果在这个界面出现故障，请联系我，同时将错误信息发送给我，谢谢！）</p>
<center> <img src="/images/确认导入信息.png" alt="确认导入信息"></center>
<p>导入信息后即可看到成功界面（只需看到成功或success即可，具体成功信息不需要在意）</p>
<h2 id="仪表盘使用" tabindex="-1"><a class="header-anchor" href="#仪表盘使用" aria-hidden="true">#</a> 仪表盘使用</h2>
<p>截止2023年11月29日19:42:22，目前仪表盘功能仅上线了账单数据的仪表盘，对于收入数据的仪表盘，预计于12月底上线。</p>
<h3 id="特别说明" tabindex="-1"><a class="header-anchor" href="#特别说明" aria-hidden="true">#</a> 特别说明</h3>
<p>由于后端服务器宽带速率限制，仪表盘数据并非实时数据，而是缓存数据，大概12小时更新一次。</p>
<h3 id="账单仪表盘的使用" tabindex="-1"><a class="header-anchor" href="#账单仪表盘的使用" aria-hidden="true">#</a> 账单仪表盘的使用</h3>
<p>账单仪表盘第一个块为账单总金额，通过银行导入的数据计算出银行所有支出金额，并进行汇总。</p>
<center> <img src="/images/仪表盘-1.png" alt="第一个仪表盘模块"></center>
<p>第二个模块为账单总数量，记录系统中所有的支出账单数量，下角的脚标为近7日账单数，同时所绘制的图形也是近7日账单的数量。</p>
<center> <img src="/images/仪表盘-2.png" alt="第二个仪表盘模块"></center>
<p>第三个模块为截止目前已支付的账单数量，部分账单可能录入了但目前并没有支付（使用银行导入功能的小伙伴请选择忽略），可以通过此模块统计账单的支付情况，第四个模块同样是对支付率进行一个评估。</p>
<center> <img src="/images/仪表盘-3,4.png" alt="第三个及第四个仪表盘模块"></center>
<h3 id="收入仪表盘的使用" tabindex="-1"><a class="header-anchor" href="#收入仪表盘的使用" aria-hidden="true">#</a> 收入仪表盘的使用</h3>
<p>请您等待更新！</p>
<h2 id="数据页面的使用" tabindex="-1"><a class="header-anchor" href="#数据页面的使用" aria-hidden="true">#</a> 数据页面的使用</h2>
<h3 id="收款人数据" tabindex="-1"><a class="header-anchor" href="#收款人数据" aria-hidden="true">#</a> 收款人数据</h3>
<p>收款人在本系统中记录了收款人姓名，收款人银行卡号及收款人备注3个信息，相比于会计系统，多了银行卡号信息，可以快速找到收款人的银行卡号。收款人系统目前查询功能提供按村庄及按姓名、银行卡号查找。</p>
<center> <img src="/images/收款人界面.png" alt="收款人界面"></center>
<p>在收款人界面，提供了添加收款人按钮，收款人需要填写姓名、银行卡号及收款人备注，添加完成后即可在收款人列表中看到该收款人。</p>
<h3 id="村庄数据" tabindex="-1"><a class="header-anchor" href="#村庄数据" aria-hidden="true">#</a> 村庄数据</h3>
<p>村庄数据记录了村庄名称，村庄区域代码以及村庄初始金额（确定初始月份后根据会计余额表登记）及剩余金额，截止2023年11月30日，正在根据建议开发每月村账余额导出及明细导出，在12月底-1月中上旬，将推出AI辅助会计科目分类，并收集人为分类数据用于模型训练。</p>
<center> <img src="/images/村庄数据界面.png" alt="村庄数据界面"></center>
<h3 id="账单数据" tabindex="-1"><a class="header-anchor" href="#账单数据" aria-hidden="true">#</a> 账单数据</h3>
<p>账单数据记录了报销人的个人信息，所属村庄，账单发生时间，账单支付时间（银行导入则与账单发生时间保持一致），账单金额，账单备注等信息，同时可根据最上方的条件进行筛选，未来亦可通过右下角的AI机器人使用自然语言进行便捷查询。</p>
<center> <img src="/images/账单数据界面.png" alt="村庄数据界面"></center>
<p>账单展示界面有箭头的代表提供排序功能，有需求的可通过排序功能对账单进行一个快捷排序。需要注意的是，排序并非单页有效，对模糊检索的所有数据同时生效。</p>
<p>如果您需要新增单条数据，请点击新增账单按钮，将会弹出一个抽屉层，来填写信息，在取消时亦会自动保存信息，特别注意，在添加账单信息时，请先前往收款人界面添加收款人信息！（前提是不刷新界面哈，如果刷新界面也有保存信息的需求未来会）</p>
<center> <img src="/images/添加账单.png" alt="添加账单"></center>
<p>修改功能亦在开发当中，正在积极收集建议确定修改功能的交互方式，目前考虑为右键或继续放在右边那一排，也请大家积极反馈意见！</p>
<h3 id="收入数据" tabindex="-1"><a class="header-anchor" href="#收入数据" aria-hidden="true">#</a> 收入数据</h3>
<p>收入数据与账单数据近一致，在数据库设计上，收入数据和账单数据其实是放在一起的，支出大于0，收入小于0，所以请参考账单数据进行操作！</p>
<h3 id="项目库的使用" tabindex="-1"><a class="header-anchor" href="#项目库的使用" aria-hidden="true">#</a> 项目库的使用</h3>
<p>项目库主要用于解决我们想要检测一些特定项目的情况，例如我们可以通过项目库来检测乡村振兴部分款是否全部到位，首先我们需要在项目库新增一个项目。</p>
<center> <img src="/images/新增项目库.png" alt="新增项目库"></center>
<p>新增完成后我们即可在项目数据中看到这个库，如果需要将账单划分到这个库，可以在账单或收入数据下找到一个账单，点击“未分类”标签，将其分类到项目库中即可。注意，项目库按村归类。</p>
<center> <img src="/images/项目库分类.png" alt="项目库分类"></center>
<p>然后我们在项目库中可以点击详情，如下图所示。</p>
<center> <img src="/images/项目详情.png" alt="项目详情"></center>
<p>项目库可以很好的解决我们一些特定项目问题，如果有更好的建议，我也会在后续继续针对这方面做更多的开发。</p>
<h2 id="工具中心的使用" tabindex="-1"><a class="header-anchor" href="#工具中心的使用" aria-hidden="true">#</a> 工具中心的使用</h2>
<p>工具中心下包含自助打印、往来指标生成模块，上面所说的银行导入功能在未来将会放入其他分类下。<br>
自助打印功能：上传一个文件，运行了对应服务端且连接了打印机的电脑会自动进行打印,对自助打印功能感兴趣的朋友可以阅读下：<a href="https://github.com/PonyWilliam/printControl" target="_blank" rel="noopener noreferrer">自助打印开源及说明</a></p>
<p>往来报告生成模块需要先在国库群中下载国库杨蕾主任提供的往来账，然后上传到往来报告模块当中并且输入好自己的单位名称以及落款单位，落款单位为右下角落款的单位，除财政所外，其他单位一般保持一致，以杨村甸为例，杨村甸乡人民政府一般为检索的抬头，杨村甸乡财政所一般为落款单位，日期选择文件名称的日期即可。</p>
<center> <img src="/images/生成往来报告.png" alt="生成往来报告"></center>
<p>点击下一步后，如果没有错误，会看到生成成功的图片，下载即可。</p>
<center> <img src="/images/往来报告成功.png" alt="往来报告成功"></center>
<p>自动生成的表格如下图所示</p>
<center> <img src="/images/自动生成的表格.png" alt="自动生成的表格"></center>
<p>自动生成后，将文件打印出来盖上章即可交到国库（如果模板内容与我的不一样，未来我可以修改）</p>
<h2 id="结束语" tabindex="-1"><a class="header-anchor" href="#结束语" aria-hidden="true">#</a> 结束语</h2>
<p>至此，你已经上手了村级财务系统的基本使用，如果后续有疑问与功能建议，可以随时提供建议，我会积极评估后进行开发，感谢大家！</p>
</div></template>


