<template><div><h1 id="介绍" tabindex="-1"><a class="header-anchor" href="#介绍" aria-hidden="true">#</a> 介绍</h1>
<p>村级财务系统现阶段存在资金使用情况不明确，出纳日记账体现不直观的问题，本系统通过网页图标形式，将资金流水进行汇总，将资金流向进行可视化，方便财务人员对资金使用情况一目了然，同时支持多样化查询方式，方便对资金进行按条件查询，提高工作效率。</p>
<h2 id="功能" tabindex="-1"><a class="header-anchor" href="#功能" aria-hidden="true">#</a> 功能</h2>
<h3 id="数据导入" tabindex="-1"><a class="header-anchor" href="#数据导入" aria-hidden="true">#</a> 数据导入</h3>
<p>数据导入提供手动导入与从银行表导入两种方式，手动导入截止2023年11月29日仍需一项一项添加，银行表导入可通过湖南农信的网上银行将账单数据导出后，快捷进行导入，数据将通过关键词智能分类到村！目前批量导入功能正在根据反馈火速进行制作中，预计2023年12月底可更新到公版。<br>
<img src="/images/银行导入.png" alt="银行表导入"></p>
<center>银行表导入</center>
<h3 id="仪表盘功能" tabindex="-1"><a class="header-anchor" href="#仪表盘功能" aria-hidden="true">#</a> 仪表盘功能</h3>
<p>仪表盘功能主要用于查看乡镇所有村的收入及支出数据，并对近日数据、各村数据做一个汇总图表，方便财务人员可视化的对村账数据有一个更为直观的了解。<br>
<img src="/images/仪表盘.png" alt="仪表盘功能"></p>
<center>仪表盘功能</center>  
<h3 id="工具中心" tabindex="-1"><a class="header-anchor" href="#工具中心" aria-hidden="true">#</a> 工具中心</h3>
<p>工具中心除数据导入功能外，还提供了自助打印、往来指标快速生成两项功能，后续也会根据各财政部门对部分便利功能的需求，增加相应的功能。<br>
自助打印：办公室有一台公用电脑，其他电脑均可通过网站对版面设计无修改需求的表格、图片等进行快捷打印，解决了办公室人多打印机少的难题。（至少目前杨村甸是这样···）<br>
往来指标自助生成：将国库杨蕾主任发送到qq群的往来指标导入本系统后，本系统会自动生成对应的往来指标报告，可直接打印盖章后上交到国库，节约排版时间，提升工作效率。</p>
<p><img src="/images/工具中心.png" alt="工具中心"></p>
<center>工具中心截图</center></div></template>


